package Ex06;

public class Ex0601 {
    public static void main(String[] args) {
        // 객체지향 언어 !! 매우중요 이것만 이해하자
        // 객체지향 언어 = 프로그래밍 언어 + 객체지향개념(규칙)
        // 코드의 재사용성이 높고 유지보수가 용이, 중복 코드 제거
        // oop = 1.캡슐화 2.상속 3.추상화 4.다형성

//-----------------------------------------------
        // 클래스의 정의 - 객체를 정의해 놓은것
        // 클래스의 용도 - 객체를 생성하는데 사용

        // 객체의 정의 - 실제로 존재하는 것 . 사물 또는 개념
        // 객체의 용도 - 객체가 가지고 있는 기능과 속성에 따라 다름
//-----------------------------------------------
        // 클래스 - 제품 설계도 / 객체 - 제품
        //   tv 설계도         /  tv

        // 설계도의 필요성 - 제품을 만들기위해서 한번 만들어 진 설계도는 계속 사용할수있다
        // 제품의 필요성 - 사람이 사용하기 위해서
        // 객체(제품)를 사용한다는 것은? - 객체가 가진 속성(변수)과 기능을 (메서드)사용하려고
//-----------------------------------------------
        // 객체(인스턴스) = 속성(변수) + 기능(메서드)
        // 속성 ex) 크기, 길이, 높이, 색상  => String color;
        // 기능 ex) 끄기, 켜기, 볼륨조절 => void power();

//-----------------------------------------------



    }
}
