package Ex06;

public class Ex0603 {
    public static void main(String[] args) {
        // 1. 객체의 생성
        // Tv t; - 참조변수 (참조형)
        // t = new Tv();
        // new Tv(); - 객체의 생성 부분 (생성자)

        // Tv t = new Tv(); 리모콘(참조변수)을 만들어주고 객체를 만들어준다음에 리모콘과 객체를 연결해준다
        // 자바에서는 객체를 다룰때 참조변수가 없으면 안된다
//------------------------------------------------
        // 2. 객체의 사용
        // 객체가 가지고 있는 변수와 메서드 사용
        // ex) t.channel = 7; - 멤버변수 channel의 값을 7로 한다 (변수를 다루는 방법)
        // ex) t.shannelDown(); - tv인스턴스의 메서드 channelDown()을 호출한다 ( 메서드 호출 )
        // 메서드가 호출되면 void shannelDown(){메서드의 문장들이 실행된다};
//------------------------------------------------
        // 순서 = 클래스 작성(설계도 작성) -> 객체생성(제품 만들기) -> 객체사용(변수와 메서드 사용)

    }

}
