package Ex06;

public class Ex0610 {
    public static void main(String[] args) {
        // 메서드 - 쉽게 생각해서 문장들을 묶어놓은것 {}
        // 1. 작업단위로 문장들을 묶어서 이름 붙인 것 그리고 메서드 호출해서 사용한다
        // 호출 이유 - 코드의 중복을 방지할 수 있다  예를 들어 for문을 두번 사용해야하는경우
        // for 문 두번 쓰지않고 호출을 이용해서 코드를 간결하게 만들 수 있다
        // 2. 값(입력)을 받아서 처리하고, 결과를 반환(출력)

//        int add(int x, int y) { - 반환타입(출력) 메서드 이름 (매개변수선언 (입력)  - 선언부
//            int result = x + y;   - 구현부 = 메서드 호출 시 수행될 코드
//            return result;  - 결과를 반환
//        }

        // 메서드 하나는 하나의 기능만 수행하도록 작성해야한다
        // 반환 타입( 작업결과의 타입 )
        // 매개변수( 작업에 필요한 값들 0~n개까지 가능 )
        // 출력값( 0 ~ 1개 까지만 가능)
        // 반환할게 없으면 void 라고 적으면 된다


    }
}
