package Ex06;

public class Ex0606 {
    public static void main(String[] args) {
        // 객체 배열 == 참조변수 배열 = 참조변수 여러개 그냥 하나에 배열로 만드늗거다
        // ex) Tv t1 =new Tv() / Tv t2 = new Tv()  이거 모아둔거임
        // tv tv1, tv2, tv3;  ->  Tv[] tvArr = new Tv[3];
        // tv 타입에 참조변수의 초기값은 null

        // 클래스 = 설계도 / 데이터 + 함수 의 결합 / 사용자 정의타입
        // 1. 설계도 - 앞에서 배움

        // 2. 데이터 + 함수 의 결합
        ////////////발전순서/////////////////
        // 1. 변수 - 하나의 데이터를 저장할 수 있는 공간 (여러개를 묶고싶어서 배열이생김)
        // 2. 배열 - 같은 종류의 여러 데이터를 하나로 저장할 수 있는 공간 (묶고보니까 같은종류의 데이터만 가능해서 구조체 생김)
        // 3. 구조체 - 서로 관련된 여러 데이터 (종류 관계x) 를 하나로 저장할 수 있는 공간 (관계있는 변수들끼리만 묶음)
        // 4. 클래스 - 데이터와 함수의 결함 (구조체 + 함수) 함수 = 메서드 (명령문)
        // 메서드가 작업을 할땐 데이터(변수)를 가지고 작업을 한다


        // 3. 사용자 정의 타입 - 원하는 타입을 직접 만들 수 있다.
        // ex) 기본형 8개 가 있는데 그외에 따로 뭔가를 하고싶다
    }

}
